FSharp/introtofsharp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>An Introduction to Microsoft F#</title>
<!-- 2016-02-09 Tue 20:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">An Introduction to Microsoft F#</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">A sum of squares example</a></li>
<li><a href="#sec-3">A larger example</a></li>
</ul>
</div>
</div>
<p>
A great introduction to F# for those who have not started looking at
it can be found <a href="http://channel9.msdn.com/blogs/pdc2008/tl11">here</a>. Luca Bolognese does a fantastic job of
introducing it. I have put together some quick notes if you are
looking for quick notes :) I would recommend watching the
presentation.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
We are used to the Imperative way of thinking;  telling the machine
how to do something not what to do, for example:
</p>

<div class="org-src-container">

<pre class="src src-c">x=x+1
</pre>
</div>

<p>
Makes sense to a programmer but would make no sense to a mathematician.
</p>

<p>
3 keywords/operators of high importance that are introduced in this
presenatation are:
</p>

<p>
let - This does not mean assign a value to var, instead, bind
something to a symbol (something could be a value, list, function)
the symbol is then immutable although can be made mutable with a
mutable keyword.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&gt; pipeline - like pipelines in command shells</td>
</tr>
</tbody>
</table>

<p>
fun  - A way to define a function on the spot (like lambda
expression)
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">A sum of squares example</h2>
<div class="outline-text-2" id="text-2">
<p>
imperative:
</p>

<div class="org-src-container">

<pre class="src src-f#"><span class="linenr">1: </span>let sqr x = x * x
<span class="linenr">2: </span>let sumofsquares nums =  
<span class="linenr">3: </span>   let mutable acc = 0
<span class="linenr">4: </span>   for x in nums do
<span class="linenr">5: </span>      acc &lt;- acc + sqr x  // assignment, rather than binding
<span class="linenr">6: </span>   acc
</pre>
</div>

<p>
functional 1, as a mathematician might write it:
</p>

<div class="org-src-container">

<pre class="src src-f#"><span class="linenr"> 7: </span>let sqr x = x * x
<span class="linenr"> 8: </span>let sumofsquares nums =  
<span class="linenr"> 9: </span>   match nums with // branching
<span class="linenr">10: </span>   | [] -&gt; 0.0 // empty list
<span class="linenr">11: </span>   | h::t -&gt; sqr h + sumOfSquares t
<span class="linenr">12: </span>Not much benefit to this
</pre>
</div>

<p>
With pipelines:
</p>

<div class="org-src-container">

<pre class="src src-f#"><span class="linenr">13: </span>let sqr x = x * x
<span class="linenr">14: </span>let sumofsquares nums =  
<span class="linenr">15: </span>   nums
<span class="linenr">16: </span>   |&gt; Seq.map sqr
<span class="linenr">17: </span>   |&gt; Seq.sum // can be parallelized
<span class="linenr">18: </span>Here there is less chances for error as Luca explains.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">A larger example</h2>
<div class="outline-text-2" id="text-3">
<p>
Luca then demostrated a data analysis example for stock market data.
</p>

<div class="org-src-container">

<pre class="src src-f#"><span class="linenr">19: </span>let csv = reader.ReadToEnd()
<span class="linenr">20: </span>let prices =
<span class="linenr">21: </span>   csv.Split([|'\'|])
<span class="linenr">22: </span>   |&gt; Seq.skip 1
<span class="linenr">23: </span>   |&gt; Seq.map (fun line -&gt; line.Split([|','|]))
<span class="linenr">24: </span>   |&gt; Seq.filter (fun values -&gt; values |&gt; Seq.length = 7)
<span class="linenr">25: </span>   |&gt; Seq.map (fun values -&gt;
<span class="linenr">26: </span>       System.Date.Parse(values.[0]),
<span class="linenr">27: </span>       float values.[6])
</pre>
</div>

<p>
He also demonstrates some visualisation, exposing the code better to
.NET, parallelising and asynchronous activity using async keyword
and let! operator and Async versions of methods - No need for
delegates.
</p>

<p>
The section on async and parallel was REALLY neat and shows off the
simplicity of F# for writing parallelized data analysis for example.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-09 Tue 20:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
